Sopan151999/STM32_projects/STM32F103C6T6A_CAN_1.3/Core/Inc/globel_data.h
/*
 * globel_data.h
 *
 *  Created on: Aug 6, 2025
 *      Author: sopan
 */

#ifndef INC_GLOBEL_DATA_H_
#define INC_GLOBEL_DATA_H_

#include "stm32f1xx_hal.h"
#include "Hdl_CAN.h"
#include "SSD_1306.h"
#include "Hdl_gpio.h"

typedef struct {
	uint8_t PA5_led : 1;
	uint8_t PA6_led : 1;
	uint8_t data1   : 1;
	uint8_t data2   : 1;
	uint8_t data3   : 1;
	uint8_t data4   : 1;
	uint8_t data5   : 1;
	uint8_t data6   : 1;
	uint8_t ADC_data   ;
	uint16_t PWM_data   ;
	uint16_t plm_data  ;

}STM_CAN_0x600;
extern STM_CAN_0x600 STM_Msg_0x600;


typedef struct {
	uint8_t Anurag_age;
	uint8_t Anurag_marks;
	uint16_t AnuragPhNo5Dig;
	uint16_t AnuragPhNo05Dig;
	uint16_t AnuragID;
}STM_CAN_0x201;
extern STM_CAN_0x201 STM_Msg_0x201;



typedef struct {
	uint64_t myPhoneNo;
}STM_CAN_0x102;
extern STM_CAN_0x102 STM_Msg_0x102;

typedef struct {
	uint32_t MyPasswoard;
	uint32_t MyID;
}STM_CAN_0x403;
extern STM_CAN_0x403 STM_Msg_0x403;

typedef struct {
	uint32_t PrashantPhNo;
	uint32_t PrashantID;
}STM_CAN_0x550;
extern STM_CAN_0x550 STM_Msg_0x550;

typedef struct {
	uint8_t gfx_Val;
	uint8_t gfx_val2;
	volatile uint8_t ledDATA1 :1;
	volatile uint8_t ledDATA2 :1;

}STM_CAN_0x301;
extern STM_CAN_0x301 STM_Msg_0x301;

//#define STM_ID_0x588 0x588U
//#define STM_ID_0x589 0x589U
//#define STM_ID_0x581 0x581U

#endif /* INC_GLOBEL_DATA_H_ */
